app/Controllers/Admin.php

    public function index()
    {
        $auth = $this->checkAuth();
        if ($auth) return $auth;

        // Récupérer les statistiques
        $stats = [
            'total_visitors' => $this->db->table('visitors')->countAllResults(),
            'total_appointments' => $this->db->table('appointments')->countAllResults(),
            'pending_appointments' => $this->db->table('appointments')->where('status', 'pending')->countAllResults(),
            'total_accounts' => $this->db->table('accounts')->countAllResults(),
            'total_contacts' => $this->db->table('contacts')->countAllResults(),
            'unread_contacts' => $this->db->table('contacts')->where('status', 'unread')->countAllResults(),
        ];

        // Récents rendez-vous
        $recent_appointments = $this->db->table('appointments')
            ->orderBy('date_appointment', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();

        // Derniers visiteurs
        $recent_visitors = $this->db->table('visitors')
            ->orderBy('date_visit', 'DESC')
            ->limit(5)
            ->get()
            ->getResultArray();
---
SELECT COUNT(*) AS `numrows`
FROM `visitors`
SELECT COUNT(*) AS `numrows`
FROM `appointments`
SELECT COUNT(*) AS `numrows`
FROM `appointments`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `accounts`
SELECT COUNT(*) AS `numrows`
FROM `contacts`
SELECT COUNT(*) AS `numrows`
FROM `contacts`
WHERE `status` = 'unread'
SELECT *
FROM `appointments`
ORDER BY `date_appointment` DESC
 LIMIT 5
SELECT *
FROM `visitors`
ORDER BY `date_visit` DESC
 LIMIT 5